'''
создать класс Hero со след атрибутами:
    свойства:
        - name
        - health
        - armor
        - strong
    
    методы:
        - print_info - вывод информации о герое
        - kick - принимает параметр enemy:Hero и коэффициент силы удара  по дефолту равный 1,
                производит один удар - высчитывает и уменьшает броню и здоровье, 
                выводит информацию в консоль
        - fight - принимает параметр enemy:Hero и производит обмен ударами (поочереди или случайно)
                пока здоровье одного героя не достигнет 0 



                
                
Создать 2 героя, вывести информацию о них, произвести бой между ними, вывести информацию 
о победителе.

'''