"""
Добавить в проект прошлого задания шаблоны. 

На главной странице сделать ссылки на каждый ендпоинт

На каждой неглавной странице сделать кнопку-ссылку - возврат на главную страницу

Добавить страницу с картинкой и счетчиком кликов по ней. 
    На главной странице  добавить ссылку  на нее 

На главной странице добавить ссылку на страницу с погодой 5 разных городов, 
    которая будет отображаться если запрос пришел на сервер в четную минуту 
    текущего времени. 
    т.е. 10:52 - ссылка отображается на главной странице, 10:51 - нет
    если пользователь сам вбивает адрес этой страницы - тоже делать проверку
    

"""